emacs/spacemacs.org
#+TITLE: spacemacs
* Windows
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />
** 安装spacemacs
#+BEGIN_EXAMPLE
git clone https://github.com/syl20bnr/spacemacs.git C:\Users\carhj\AppData\Roaming\.emacs.d
命名为.emacs.d(必须是.emacs.d)
C:\Users\carhj\AppData\Roaming为用户Windows下对应的HOME目录
#+END_EXAMPLE


** 启动emacs
#+BEGIN_EXAMPLE
1 选择emacs模式
2 选择standard(spacemacs)
3 选择full-featured(helm)
4 第一次一般启动，然后关闭emacs
5 HOME目录下会自动C:\Users\carhj\AppData\Roaming\.spacemacs这个文件
#+END_EXAMPLE


** 编辑%HOME%/.spacemacs文件

+ ，修改插件仓储链接超时时间为60秒
#+BEGIN_EXAMPLE
dotspacemacs-elpa-timeout 60
#+END_EXAMPLE

+ 修改LPA的仓储源，在 dotspacemacs/user-init 函数中
#+BEGIN_EXAMPLE
(setq configuration-layer--elpa-archives
    '(("melpa-cn" . "http://elpa.emacs-china.org/melpa/")
      ("org-cn"   . "http://elpa.emacs-china.org/org/")
      ("gnu-cn"   . "http://elpa.emacs-china.org/gnu/")))
#+END_EXAMPLE


+ 修改默认字体大小，在 dotspacemacs-default-font 函数中
#+BEGIN_EXAMPLE
 dotspacemacs-default-font '("Source Code Pro"
                             :size 18
                             :weight normal
                             :width normal
                             :powerline-scale 1.2)

#+END_EXAMPLE


+ 安装 source code font 字体
#+BEGIN_EXAMPLE
1 https://github.com/adobe-fonts/source-code-pro/downloads 下载 source code font 字体
2 TTF下所有文件拷贝到c:/windows/font
#+END_EXAMPLE

+ 安装 zlib
#+BEGIN_EXAMPLE
1 http://gnuwin32.sourceforge.net/packages/zlib.htm 下载windows版本的zlib
2 安装zlib，一路回车法，将安装后的bin添加到PATH环境变量中去
#+END_EXAMPLE

+ 安装 aspell
#+BEGIN_EXAMPLE
1 http://aspell.net/ 下载Aspell-0-50-3-3-Setup.exe，Aspell-en-0.50-2-3.exe两个软件
2 先安装Aspell-0-50-3-3-Setup.exe，再安装Aspell-en-0.50-2-3.exe（属于字典库）
3 安装后的bin添加到PATH环境变量中去
#+END_EXAMPLE


+ 安装 diff
#+BEGIN_EXAMPLE
1 https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/ 下载KDiff3-64bit-Setup_0.9.98-2.exe
2 一路回车法安装diff
3 安装后的bin添加到PATH环境变量中去
#+END_EXAMPLE
* Linux

