emacs/spacemacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-12 周一 00:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>spacemacs</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />

</head>
<body>
<div id="content">
<h1 class="title">spacemacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd5d282b">1. Windows</a>
<ul>
<li><a href="#org747c822">1.1. 安装spacemacs</a></li>
<li><a href="#org494dea3">1.2. 启动emacs</a></li>
<li><a href="#org37f38d0">1.3. 编辑%HOME%/.spacemacs文件</a></li>
</ul>
</li>
<li><a href="#org44cc7ce">2. Linux</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5d282b" class="outline-2">
<h2 id="orgd5d282b"><span class="section-number-2">1</span> Windows</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org747c822" class="outline-3">
<h3 id="org747c822"><span class="section-number-3">1.1</span> 安装spacemacs</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
git clone https://github.com/syl20bnr/spacemacs.git C:\Users\carhj\AppData\Roaming\.emacs.d
命名为.emacs.d(必须是.emacs.d)
C:\Users\carhj\AppData\Roaming为用户Windows下对应的HOME目录
</pre>
</div>
</div>


<div id="outline-container-org494dea3" class="outline-3">
<h3 id="org494dea3"><span class="section-number-3">1.2</span> 启动emacs</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
1 选择emacs模式
2 选择standard(spacemacs)
3 选择full-featured(helm)
4 第一次一般启动，然后关闭emacs
5 HOME目录下会自动C:\Users\carhj\AppData\Roaming\.spacemacs这个文件
</pre>
</div>
</div>


<div id="outline-container-org37f38d0" class="outline-3">
<h3 id="org37f38d0"><span class="section-number-3">1.3</span> 编辑%HOME%/.spacemacs文件</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>，修改插件仓储链接超时时间为60秒</li>
</ul>
<pre class="example">
dotspacemacs-elpa-timeout 60
</pre>

<ul class="org-ul">
<li>修改LPA的仓储源，在 dotspacemacs/user-init 函数中</li>
</ul>
<pre class="example">
(setq configuration-layer--elpa-archives
    '(("melpa-cn" . "http://elpa.emacs-china.org/melpa/")
      ("org-cn"   . "http://elpa.emacs-china.org/org/")
      ("gnu-cn"   . "http://elpa.emacs-china.org/gnu/")))
</pre>


<ul class="org-ul">
<li>修改默认字体大小，在 dotspacemacs-default-font 函数中</li>
</ul>
<pre class="example">
dotspacemacs-default-font '("Source Code Pro"
                            :size 18
                            :weight normal
                            :width normal
                            :powerline-scale 1.2)
</pre>


<ul class="org-ul">
<li>安装 source code font 字体</li>
</ul>
<pre class="example">
1 https://github.com/adobe-fonts/source-code-pro/downloads 下载 source code font 字体
2 TTF下所有文件拷贝到c:/windows/font
</pre>

<ul class="org-ul">
<li>安装 zlib</li>
</ul>
<pre class="example">
1 http://gnuwin32.sourceforge.net/packages/zlib.htm 下载windows版本的zlib
2 安装zlib，一路回车法，将安装后的bin添加到PATH环境变量中去
</pre>

<ul class="org-ul">
<li>安装 aspell</li>
</ul>
<pre class="example">
1 http://aspell.net/ 下载Aspell-0-50-3-3-Setup.exe，Aspell-en-0.50-2-3.exe两个软件
2 先安装Aspell-0-50-3-3-Setup.exe，再安装Aspell-en-0.50-2-3.exe（属于字典库）
3 安装后的bin添加到PATH环境变量中去
</pre>


<ul class="org-ul">
<li>安装 diff</li>
</ul>
<pre class="example">
1 https://sourceforge.net/projects/kdiff3/files/kdiff3/0.9.98/ 下载KDiff3-64bit-Setup_0.9.98-2.exe
2 一路回车法安装diff
3 安装后的bin添加到PATH环境变量中去
</pre>
</div>
</div>
</div>
<div id="outline-container-org44cc7ce" class="outline-2">
<h2 id="org44cc7ce"><span class="section-number-2">2</span> Linux</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-12 周一 00:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
